'use client';

import React, { useEffect, useState } from 'react';
import { useRouter } from '@/i18n/routing';
import PocketBase from 'pocketbase';
import styles from './page.module.scss';

const pb = new PocketBase("https://back.fatvo.saidoff.uz");
import { useTranslations } from 'next-intl';
import { useLocale } from "next-intl";


const aboutText = {
  ru: `Бисмиллаҳир Роҳманир Роҳим <span></span>

Инсон ўзи билмаган нарсасини уламолардан сўраб ўрганиши керак.  Зеро, Аллоҳ таоло Қуръони каримда: <span></span>

فَاسْأَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لَا تَعْلَمُونَ <span></span>

яъни: “Агар билмайдиган бўлсангиз, зикр аҳлларидан сўрангиз!”, деб буюрган (Наҳлсураси, 43-оят). <span></span>

Расулуллоҳ саллаллоҳу алайҳи васаллам: “Билимсизликнинг давоси саволдир”, – дея марҳамат қилганлар (Имом Абу Довуд ривояти). <span></span>

Савол сўрашнинг ҳам ўз қоидалари бор. “Fatvo.uz” сайтидан фойдаланувчиларга ушбу қоида ва одобларини эслатиб ўтамиз: <span></span>

САВОЛ БЕРИШ ҚОИДАЛАРИ <span></span>

Саволингизга жавобни аввало мўътабар диний адабиётлардан қидиринг. Топа олмасангиз, “қидирув хизматидан” излаб кўринг. Такрорий саволларга жавоб берилмайди.
Саволни иложи борича имловий хатолардан холи қилиб ёзинг. Йўллаган саволингиз ҳаммага кўринишини эътиборга олиб беҳаё ва беъмани сўзларни ёзманг. Зеро, яхши савол ярим илмдир. Инсон ҳар бир сўзи учун масъулдир.
Саволингиз дунё ва охиратга фойда келтирадиган, имкон қадар тушунарли, қисқа ва лўнда, салом-аликлардан, ҳамду сано ва ташаккурлардан холи бўлсин. Чунки вақт энг қиммат нарсалардандир.
Турли мавзулардаги саволларни бир марта савол беришда жамламанг. Уларни алоҳида-алоҳида беринг.
Ушбу сайт, фитнага сабаб бўлувчи саволлар, бирор шахс ҳақида маълумот оладиган, тортишув ва низолар жойи эмас.
ҚУЙИДАГИ МАВЗУДАГИ САВОЛЛАРГА ЖАВОБ БЕРИЛМАЙДИ: <span></span>

 “Сайт” масъулларининг шахси сўралган саволлар, туш таъбирлари, дунё охиратга фойдаси йўқ саволлар, саволга жавоб берилмаганининг сабабини сўраш ва “Фалон олимнинг гапига нима дейсиз” кабилар. <span></span>

САВОЛ СЎРОВЧИГА ЛОЗИМ БЎЛГАН ОДОБЛАР <span></span>

Фатво берувчи олим, ундан савол сўраган кишига нисбатан устоз мақомида бўлади. Устозларнинг ҳурматини сақлаш керак. Фатво сўровчи учун қуйидагилар макруҳдир: <span></span>

Динда фойдаси йўқ нарсаларни сўраш. <span></span>
Воқеъликда йўқ нарсани сўраш. <span></span>
Таъаббудий масалаларнинг ҳикматини сўраш (Бомдод намози нима учун икки ракъат, нега намозда икки марта сажда қилинади, кабилар). <span></span>
Саволда ҳаддан ташқари чуқур кетиш. <span></span>
Бошқалардан устун келиш учун қайсарлик ила сўраш. <span></span>
Бир олимга савол бериб, жавоб олгач, бошқа олимдан яна ўша саволни сўраш. <span></span>
Енгил фатво берадиган одамни излаб топиб, сўраш. Агар илмда ва адолатда бир хил олимлар кўп бўлсалар, сўровчи ўзи истаган олимга мурожаат қилиши мумкин. Аммо баъзи уламолар: “Бундай ҳолатда уларнинг энг афзалидан сўраган маъқул”, деганлар. <span></span>
САЙТ МАЪМУРИЯТИ ҲУҚУҚЛАРИ <span></span>

“Fatvo.uz” сайти масъуллари саволларга жавоб бериш ёки бермаслик масаласини мустақил ҳал қилиш ҳуқуқига эгадирлар. <br>
“Сайт” масъуллари, шунингдек, сайт муҳаррирлари баъзи саволларга нима сабабдан жавоб берилмагани ҳақида маълумот бериш мажбуриятига эга эмасдирлар. <br>
“Сайт” масъуллари, саволлардаги имловий хатоларни тўғрилаш ва бошқа ўқувчиларга ҳам тушунарли бўлиши учун, ундаги умумий маънони ўзгартирмаган ҳолда, таҳрир қилиш ҳуқуқига эга. <br>
“Сайт” масъуллари берилган саволларнинг бўлимларини ўзгартириш, вақти-вақти билан сайтда жавобсиз қолган ва фойдадан йироқ бўлган саволларни сайтдан ўчириб туриш ҳуқуқига эга.` 
};

function AboutPage({ }) {
  const t = useTranslations();
  const locale = useLocale();

  return (
    <section>
      <div className="bg-background py-7 [@media(max-width:576px)]:py-5 drop-shadow-md">
        <h3 className="text-center text-2xl [@media(max-width:576px)]:text-xl text-brand font-semibold">{t("about")}</h3>
      </div>
      <div className="container mt-6 bg-background">
        <div className='px-2.5 pt-6 pb-10 [@media(max-width:576px)]:px-0'>
          <p
            className={`${styles.h} leading-7 text-lg [@media(max-width:576px)]:text-base`}
            dangerouslySetInnerHTML={{ __html: aboutText.ru }}
          />
        </div>
      </div>
    </section>
  );
}

export default AboutPage;


